Revit 2024 API
ViewsExportingByContextEventArgs Class
 The event arguments used by the ViewsExportingByContext event.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public class ViewsExportingByContextEventArgs : RevitAPIPreDocEventArgs
Visual Basic
Public Class ViewsExportingByContextEventArgs _
	Inherits RevitAPIPreDocEventArgs
Visual C++
public ref class ViewsExportingByContextEventArgs : public RevitAPIPreDocEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.ViewsExportingByContextEventArgs
See Also
ViewsExportingByContextEventArgs Members
Autodesk.Revit.DB.Events Namespace